productos/app/controllers/categorias_controller.rb

INSERT INTO "categorias" ("nombre") VALUES('verduras') RETURNING "id"
---
  def create
    @categoria = Categoria.new(params[:categoria])
    if @categoria.save

UPDATE "categorias" SET "nombre" = 'verduras' WHERE "id" = 1
---
  def update

    if @categoria.update_attributes(params[:categoria])

DELETE FROM "categorias" WHERE "id" = 3
---
  def destroy
    @categoria.destroy

SELECT * FROM "categorias" WHERE ("categorias"."id" = '3') LIMIT 1
---
  def find_categoria
    @categoria = Categoria.find_by_id(params[:id])