productos/app/controllers/productos_controller.rb

  def index
    @title = "Listado de Productos"
    @productos = Producto.find(:all, :order => "nombre ASC")
---
SELECT "productos".id FROM "productos" WHERE ("productos"."nombre" = 'oregano' AND "productos".id <> 13) LIMIT 1

  def list
    @title = "Listado de Productos"
    @categoria = Categoria.find_by_id(params[:id])
---
SELECT * FROM "categorias" WHERE ("categorias"."id" = '4') LIMIT 1

  def create
    @producto = Producto.new(params[:producto])

    if @producto.save
---
INSERT INTO "productos" ("categoria_id", "nombre", "precio", "granel", "stock", "created_at", "updated_at", "foto_file_name") VALUES(13, 'paté de ternera', 390, 'f', 25, '2010-08-05 07:04:17.462942', '2010-08-05 07:04:17.462942', NULL) RETURNING "id"

  def edit
    @title = "Editando Producto"
    @producto = Producto.find_by_id(params[:id])
---
SELECT * FROM "productos" WHERE ("productos"."id" = '9') LIMIT 1

  def update
    @producto = Producto.find_by_id(params[:id])

    if @producto.update_attributes(params[:producto])
---
SELECT * FROM "productos" WHERE ("productos"."id" = '5') LIMIT 1
UPDATE "productos" SET "nombre" = 'orégano', "categoria_id" = 2, "updated_at" = '2010-07-26 05:32:32.757816' WHERE "id" = 1

  def destroy
    @producto = Producto.find_by_id(params[:id])
    @producto.destroy
---
SELECT * FROM "productos" WHERE ("productos"."id" = '13') LIMIT 1
DELETE FROM "productos" WHERE "id" = 13

  def buscar
    @producto = Producto.find_by_nombre(params[:buscar])
---
SELECT * FROM "productos" WHERE ("productos"."nombre" = 'ketchup 100 grs.') LIMIT 1

  def find_categorias
    @categorias = Categoria.all
---
SELECT * FROM "categorias"