blogin15/app/controllers/comments_controller.rb

  def create
    # Validar, enviar mensaje!!
    #@post = Post.find_by_id(params[:post_id])
    @post.comments.create(params[:comment])
---
INSERT INTO "comments" ("post_id", "author", "body", "created_at", "updated_at") VALUES(1, 'First Comment!', 'First comment!', '2010-07-20 06:35:25', '2010-07-20 06:35:25')

  def destroy
    #@post = Post.find_by_id(params[:post_id])
    comment = Comment.find_by_id(params[:id])
    comment.destroy
---
SELECT * FROM "comments" WHERE ("comments"."id" = '1') LIMIT 1
DELETE FROM "comments" WHERE "id" = 1

  def find_post
    @post = Post.find_by_id(params[:post_id])
---
SELECT * FROM "posts" WHERE ("posts"."id" IS NULL) LIMIT 1