blogin15/app/controllers/posts_controller.rb

  def show
    @post = Post.find_by_id(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = '1') LIMIT 1

  def create
    @post = Post.new(params[:post])

    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES('Se agrega index, y before_filter', 'Index, en una migración: \n

  def edit
    @post = Post.find_by_id(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = '4') LIMIT 1

  def update
    @post = Post.find_by_id(params[:id])

    if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = '2') LIMIT 1
UPDATE "posts" SET "title" = 'Editado', "body" = 'Post editado!', "updated_at" = '2010-07-20 04:55:17' WHERE "id" = 2

  def destroy
    post = Post.find_by_id(params[:id])
    post.destroy
---
SELECT * FROM "posts" WHERE ("posts"."id" = '2') LIMIT 1
DELETE FROM "posts" WHERE "id" = 2