mensajes/app/controllers/notes_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
INSERT INTO "notes" ("user_id", "title", "body", "created_at", "updated_at") VALUES(2, 'Hello', 'World', '2010-07-14 01:19:41.906547', '2010-07-14 01:19:41.906547') RETURNING "id"
---
  def create
    # Creation of a new note
    if params[:note] # if there are parameters pased
      if @user = User.find_by_id(params[:note][:user_id]) # if the user exist
        @note = Note.new(params[:note])
        @note.save

SELECT * FROM "notes" ORDER BY updated_at desc
---
  def list
    # Get all the note records from notes db table
    @notes = Note.find :all, :order => 'updated_at desc'

SELECT * FROM "notes" WHERE ("notes"."id" = '2') LIMIT 1
---
  def show
    @note = Note.find_by_id params[:id]

DELETE FROM "notes" WHERE "id" = 7
SELECT * FROM "notes" WHERE ("notes"."id" IS NULL) LIMIT 1
---
  def destroy
    Note.find_by_id(params[:id]).destroy